Revit 2027 API
RebarShapeDrivenAccessor.GetBarPositionTransform Method
 Return a transform representing the relative position of any individual bar in the set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform GetBarPositionTransform(
	int barPositionIndex
)
Public Function GetBarPositionTransform (
	barPositionIndex As Integer
) As Transform
public:
Transform^ GetBarPositionTransform(
	int barPositionIndex
)
member GetBarPositionTransform :
        barPositionIndex : int -> Transform
Parameters
barPositionIndex Int32
 An index between 0 and (NumberOfBarPositions-1).
Return Value
Transform
 The position of a bar in the set relative to the first position.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
InvalidOperationException |  This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
Remarks
 The transform is a translation along the distribution path. It can be applied to the results of GetCenterlineCurves() to produce any bar in the rebar set. For barPositionIndex=0, the identity transform is always returned.
See Also
Reference
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace